<h2>Soal 1: Pivoting and Melting</h2>

Jelaskan itu pivoting dan melting data

jawaban:

Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column.  Dapat juga dikatakan bahwa pivoting tabel adalah melakukan perubahan pada bentuk data dari yang tadinya panjang menjadi lebar. 

Melting adalah ‘unpivoting’, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi column menjadi di posisi row. Melting mengubah data yang tadinya lebar menjadi panjang.

Melting berguna ketika ada suatu kasus dimana terdapat satu atau lebih column yang merupakan identifier variable, dan columnn lain adalah measure variabel. Identifier variabel adalah suatu entitias yang melakukan identifikasi terhadap suatu variabel yang sedang di ukur.

Apabila kita memiliki suatu besaran yang nilainya selalu berubah, kemudian kita ingin mengamati perubahan itu, berarti kita sedang memperlakukan besaran itu sebagai measure variabel. dan kita perlu sesuatu yang mereferensikan perubahan tersebut. hal itu di sebut identifier variable.

<h2>Soal 2: Data structure Comprehension</h2>

Data yang rapi adalah:
1. Setiap row menunjukan suatu unit observasi
2. Setiap column merupakan suatu unit variable

Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut

![alt text](https://drive.google.com/uc?id=1h13CDPzIjc-2XyRcyu-p1fet0Ep1gdMA)

![alt text](https://drive.google.com/uc?id=12ji98ell5tNcCxeBzl4v8qqBtFMgDSr0)

Tabel 1 dan 2 menjelaskan tentang rata-rata waktu belajar dalam setiap mata pelajaran yang diobservasi pada setiap tipe ujian, tetapi memiliki struktur data yang berbeda.

Tabel 1 memiliki struktur data yang lebar dengan mata pelajaran sebagai unit variabel dan tipe ujian sebagai unit observasi serta rata-rata waktu belajar sebagai value. 

Sedangkan tabel 2 memiliki struktur data yang panjang tanpa adanya unit observasi dengan menyajikan ketiga varibel; tipe ujian, mata pelajaran, dan rata-rata waktu belajar sebagai unit varibel. Oleh karena itu, tabel 2 memiliki tiga values sesuai unit varibelnya.

<h2>Soal 3: Reshaping Data 1</h2>

In [1]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          446                 41
1        UAS1         Fisika                          711                 84
2        UTS2         Fisika                          395                 99
3        UAS2         Fisika                          492                 63
4        UTS1     Matematika                          342                 50
5        UAS1     Matematika                          532                 63
6        UTS2     Matematika                          255                 93
7        UAS2     Matematika                          408                 40
8        UTS1     Statistika                          510                 40
9        UAS1     Statistika                          206                 96
10       UTS2     Statistika                          474                 48
11       UAS2     Statistika                          228                 87

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [5]:
pivot_result = df.pivot_table(values=['Rata2 Nilai Ujian', 'Rata2 Waktu Belajar (menit)'],
                             index='Tipe Ujian',
                             columns=['Mata Pelajaran'])

pivot_result

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          84         63         96
UAS2                          63         40         87
UTS1                          41         50         40
UTS2                          99         93         48

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   711        532        206
UAS2                                   492        408        228
UTS1                                   446        342        510
UTS2                                   395        255        474

Expected Result:

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Soal 4: Reshaping Data 2</h2>

In [9]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [10]:
df.reset_index().melt(id_vars='Hari', value_vars=['Kebun Binatang', 'Dufan', 'Disney', 'Bali'],
                     var_name='Tempat Hiburan', value_name='Pengunjug')

     Hari  Tempat Hiburan  Pengunjug
0   Sabtu  Kebun Binatang        271
1  Minggu  Kebun Binatang        399
2   Sabtu           Dufan        501
3  Minggu           Dufan        700
4   Sabtu          Disney       1000
5  Minggu          Disney       1001
6   Sabtu            Bali        900
7  Minggu            Bali        803

Expected Result:

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

<h2>Soal 5: Pivoting and Aggregating</h2>

In [11]:
import pandas as pd
import numpy as np

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

In [12]:
df.pivot_table(index='Tipe Ujian', columns='Mata Pelajaran', values='Jumlah Peserta', aggfunc=sum)

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14

Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

Expected Result:

![alt text](https://drive.google.com/uc?id=1emoz7orYR-0mCHffvAgM8j-V1P6yVHf0)